In [1]:
import pandas as pd
df = pd.read_csv('NISPUF17.csv')

In [2]:
df.head()

,Unnamed: 0,SEQNUMC,SEQNUMHH,PDAT,PROVWT_D,RDDWT_D,STRATUM,YEAR,AGECPOXR,HAD_CPOX,...,XVRCTY2,XVRCTY3,XVRCTY4,XVRCTY5,XVRCTY6,XVRCTY7,XVRCTY8,XVRCTY9,INS_STAT2_I,INS_BREAK_I
0,1,128521,12852,2,NaN,235.916956,1031,2017,NaN,2,...,,,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2,10741,1074,2,NaN,957.353840,1068,2017,NaN,2,...,,,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,220011,22001,2,NaN,189.611299,1050,2017,NaN,2,...,,,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,86131,8613,1,675.430817,333.447418,1040,2017,NaN,2,...,,,NaN,NaN,NaN,NaN,NaN,NaN,1.0,2.0
4,5,227141,22714,1,482.617748,278.768063,1008,2017,NaN,2,...,,,NaN,NaN,NaN,NaN,NaN,NaN,2.0,1.0

In [3]:
len(df.columns)

454

In [24]:
edu = [i for i in df.columns if i.startswith("HAD")]
edu

[]

In [35]:
df.groupby(["EDUC1","HAD_CPOX"]).size().unstack(0).apply(lambda x: x/x.sum(), axis=0)

EDUC1            1         2         3         4
HAD_CPOX
1         0.032369  0.014880  0.010144  0.012009
2         0.957645  0.980228  0.987713  0.985062
77        0.009986  0.004892  0.002143  0.002709
99             NaN       NaN       NaN  0.000220

In [36]:
# lets replace the numeric value of EDUC1
df['MEDUC1'] = df["EDUC1"]

In [41]:
df["MEDUC1"] = df['MEDUC1'].replace({1: "less than high school",
                                            2: "high school",
                                            3 : "more than high school but not collage",
                                            4 : "collage"})
df["MEDUC1"].value_counts()

collage                                  13656
more than high school but not collage     6999
high school                               4906
less than high school                     2904
Name: MEDUC1, dtype: int64

In [63]:
each_row=df["MEDUC1"].value_counts()
su = df["MEDUC1"].value_counts().sum()
(each_row/su).to_dict()

{'collage': 0.47974705779026877,
 'more than high school but not collage': 0.24588090637625154,
 'high school': 0.172352011241876,
 'less than high school': 0.10202002459160373}

# Question 2

In [82]:
df[[i for i in df.columns if "BF" in i]]
df["CBF_01"].value_counts()

1     24261
2      4085
77      110
99        9
Name: CBF_01, dtype: int64

In [83]:
# copy it to a other coulmn
df['MCBF_01'] = df["CBF_01"]

In [153]:
df["MCBF_01"]=df["MCBF_01"].replace({1:"Had_bfm",
                      2: "not_had_bfm"})
print(df['MCBF_01'].value_counts())

Had_bfm        24261
not_had_bfm     4085
77               110
99                 9
Name: MCBF_01, dtype: int64

# Question 2
Let's explore the relationship between being fed breastmilk as a child and getting a seasonal influenza vaccine from a healthcare provider. Return a tuple of the average number of influenza vaccines for those children we know received breastmilk as a child and those who know did not.

In [158]:
df[[i for i in df.columns if "P_NUMFLU" in i]]

       P_NUMFLU  P_NUMFLUL  P_NUMFLUM  P_NUMFLUN
0           NaN        NaN        NaN        NaN
1           NaN        NaN        NaN        NaN
2           NaN        NaN        NaN        NaN
3           3.0        0.0        0.0        3.0
4           0.0        0.0        0.0        0.0
...         ...        ...        ...        ...
28460       NaN        NaN        NaN        NaN
28461       NaN        NaN        NaN        NaN
28462       NaN        NaN        NaN        NaN
28463       NaN        NaN        NaN        NaN
28464       NaN        NaN        NaN        NaN

[28465 rows x 4 columns]

In [169]:
# Frequency of all INfluenza_Vac_injected  with out 0 value
print(df[df["P_NUMFLU"] > 0]["P_NUMFLU"].value_counts().sort_values())

6.0       3
5.0      35
4.0    1282
1.0    1679
2.0    3350
3.0    4845
Name: P_NUMFLU, dtype: int64

In [170]:
# total num of breast fed milk children
# with influenza vaccine and num of child where 77, 99[categorical]
# value are excluded because we just wanna know how many child having
# breast fed milk or others who don't

len(df[(df["P_NUMFLU"] >0 ) & (df["CBF_01"] < 77 )])

11166

In [172]:
# note = inf_df is copy of df[dataframe] 
# but a little mask of real dataframe
# with filtering like inf_df [ not having 0 P_NUMFLU[ which is VAC]]

# num of child with Vaccine and having breast fed milk
print(len(inf_df[inf_df["CBF_01"] == 1]["CBF_01"]))

# num of child with vaccine but didn't get to BFM[ breast fed milk]
print(len(inf_df[inf_df["CBF_01"] == 2]["CBF_01"]))

# num of child, i mean dataframe, because each row represent a child
# with [77 categorical num]
print(len(inf_df))

9825
1341
11194

In [171]:
# a little mask over the DF which is INf_DF
inf_df =df[df["P_NUMFLU"] > 0]

# pivot table of [how many time vaccine given]
# and [the children with BReast_fed or not]
inf_df.groupby(["P_NUMFLU", "MCBF_01"]).size().unstack(1)#.apply(lambda x: x/x.sum(), axis = 0)
# it just a liittle representation for understanding

MCBF_01     77   99  Had_bfm  not_had_bfm
P_NUMFLU
1.0        7.0  NaN   1395.0        277.0
2.0       11.0  NaN   2917.0        422.0
3.0        7.0  1.0   4334.0        503.0
4.0        2.0  NaN   1143.0        137.0
5.0        NaN  NaN     33.0          2.0
6.0        NaN  NaN      3.0          NaN

In [173]:
#sum of or len of all the Influenza vaccine with out 0
# and children othe than [77, 99[ categorical value], used for na or nan]
#
#      / *divided by*
# sum of all the child with breast fed milk
# that result in [ AVG num of vaccine for who have breast fed milk]

inf_df["P_NUMIPV"].sum()
len(df[(df["P_NUMFLU"] >0 ) & (df["CBF_01"] < 77 )])/len(inf_df[inf_df["CBF_01"] == 1]["CBF_01"])

1.1364885496183206

In [174]:
# same process as before  but divided by children \
# NOT with breast fed milk 

len(df[(df["P_NUMFLU"] >0 ) & (df["CBF_01"] < 77 )])/len(inf_df[inf_df["MCBF_01"] == "not_had_bfm"]["MCBF_01"])

8.32662192393736